null/xdslog/sentMessages/2015/5/11/sent_ProvideAndRegisterDocumentSet-b_null#86001111-d9cb-4236-a6b7-1e136530a47d.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
<S:Header>
<To xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">http://iol.test.ohie.org:5001/xdsrepository</To>
<Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</Action>
<ReplyTo xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo>
<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:86001111-d9cb-4236-a6b7-1e136530a47d</MessageID>
</S:Header>
<S:Body>
<ns4:ProvideAndRegisterDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
<ns3:SubmitObjectsRequest>
<RegistryObjectList>
<ExtrinsicObject id="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
<Slot name="creationTime">
<ValueList>
<Value>20150504</Value>
</ValueList>
</Slot>
<Slot name="languageCode">
<ValueList>
<Value>en-us</Value>
</ValueList>
</Slot>
<Slot name="serviceStartTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="serviceStopTime">
<ValueList>
<Value>201505041006</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientId">
<ValueList>
<Value>PID-3|9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="sourcePatientInfo">
<ValueList>
<Value>PID-3|9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO</Value>
<Value>PID-5|Pérez^May</Value>
<Value>PID-7|19910606</Value>
<Value>PID-8|F</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Immunization History"/>
</Name>
<Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" id="urn:uuid:34d72098-cfae-4796-8373-c1cfab319c97" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>8812399^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Dr. Family's Family Health Practice</Value>
</ValueList>
</Slot>
<Slot name="authorRole">
<ValueList>
<Value>Attending</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" id="urn:uuid:49306170-c2b1-4c6b-8f73-505e527395c8" nodeRepresentation="Outpatient Care">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon practiceSettingCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Outpatient Care"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" id="urn:uuid:43932916-5e48-4aa3-b1d5-9c4d56d19c25" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" id="urn:uuid:349a6434-58e1-4fab-9bd2-c9a7acde077a" nodeRepresentation="1.3.6.1.4.1.21367.2006.7.101">
<Slot name="codingScheme">
<ValueList>
<Value>Connect-a-thon confidentialityCodes</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Normal"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" id="urn:uuid:4d184b03-a068-48ce-af94-1c8434fa2501" nodeRepresentation="urn:ihe:pcc:aps:2007">
<Slot name="codingScheme">
<ValueList>
<Value>1.3.6.1.4.1.19376.1.2.3</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="urn:ihe:pcc:aps:2007"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" id="urn:uuid:711d1f06-218f-4a5c-970c-6b232ae8a74e" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" id="urn:uuid:bf06b1b0-ae8b-471b-a270-7d1fddcc0ce7" nodeRepresentation="PC">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.5.11</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Primary Care Clinic"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:6c4120bf-2f45-46b0-8b8c-4f70c5b87fed" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" registryObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" value="9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSDocumentEntry.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:8af49125-66a2-4293-b7d7-d73851434576" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" registryObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" value="2.16.840.1.113883.3.72.5.9.1.0.1948340109894151921">
<Name>
<LocalizedString value="XDSDocumentEntry.uniqueId"/>
</Name>
</ExternalIdentifier>
</ExtrinsicObject>
<RegistryPackage id="urn:uuid:1fcefa6a-568b-4ac8-aac7-4666dd134519">
<Slot name="submissionTime">
<ValueList>
<Value>20150504110603</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="SMS Gateway Package"/>
</Name>
<Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="urn:uuid:1fcefa6a-568b-4ac8-aac7-4666dd134519" id="urn:uuid:6f563401-eaec-4978-805d-15cf19998fe9" nodeRepresentation="">
<Slot name="authorPerson">
<ValueList>
<Value>8812399^^^^^^^^&amp;2.25.309768652999692686176651983274504471835.646.3.4&amp;ISO</Value>
</ValueList>
</Slot>
<Slot name="authorInstitution">
<ValueList>
<Value>Dr. Family's Family Health Practice</Value>
</ValueList>
</Slot>
<Slot name="authorRole">
<ValueList>
<Value>Attending</Value>
</ValueList>
</Slot>
</Classification>
<Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="urn:uuid:1fcefa6a-568b-4ac8-aac7-4666dd134519" id="urn:uuid:2abeaca6-7070-4c4b-98d5-9a0b45423457" nodeRepresentation="57055-6">
<Slot name="codingScheme">
<ValueList>
<Value>2.16.840.1.113883.6.1</Value>
</ValueList>
</Slot>
<Name>
<LocalizedString value="Antepartum Summary Note"/>
</Name>
</Classification>
<ExternalIdentifier id="urn:uuid:54feb6f9-721f-454c-b194-995eaba2c7cf" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" registryObject="urn:uuid:1fcefa6a-568b-4ac8-aac7-4666dd134519" value="9ef9b8ec-764f-4f5c-b280-f9a6952817b7^^^&amp;2.16.840.1.113883.3.72.5.9.1&amp;ISO">
<Name>
<LocalizedString value="XDSSubmissionSet.patientId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:a0b75c1a-49ec-4104-aeb4-1178e2b3c455" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" registryObject="urn:uuid:1fcefa6a-568b-4ac8-aac7-4666dd134519" value="2.16.840.1.113883.3.72.5.9.1.0.4948340109114151921">
<Name>
<LocalizedString value="XDSSubmissionSet.uniqueId"/>
</Name>
</ExternalIdentifier>
<ExternalIdentifier id="urn:uuid:52571101-64de-4d96-b5f5-9b4c21d2ddad" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" registryObject="urn:uuid:1fcefa6a-568b-4ac8-aac7-4666dd134519" value="2.16.840.1.113883.3.72.5.9.1.2.5190328671848149170">
<Name>
<LocalizedString value="XDSSubmissionSet.sourceId"/>
</Name>
</ExternalIdentifier>
</RegistryPackage>
<Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12" id="urn:uuid:27af1166-cfb6-443b-9bdf-51f62cb18926"/>
<Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="urn:uuid:acf2c819-a81f-47fe-8fc9-535d3a756c5a" sourceObject="urn:uuid:1fcefa6a-568b-4ac8-aac7-4666dd134519" targetObject="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12">
<Slot name="SubmissionSetStatus">
<ValueList>
<Value>Original</Value>
</ValueList>
</Slot>
</Association>
</RegistryObjectList>
</ns3:SubmitObjectsRequest>
<ns4:Document id="urn:uuid:93603cf9-beed-4f7c-8a8d-51d945ce5d12">
<xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:98d751d9-d13a-45c2-85a7-9d79f08ef41b"/>
</ns4:Document>
</ns4:ProvideAndRegisterDocumentSetRequest>
</S:Body>
</S:Envelope>
